Project/Toir/src/Catalogs/Календари/Календари.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Календари</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Круглосуточно</name>
      <description>Круглосуточно</description>
    </items>
  </predefined>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>EnumRef.СпособыЗаполненияГрафикаРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтсчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПраздники</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецГрафика</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидКалендаря</name>
    <type>
      <types>EnumRef.УдалитьВидыКалендарей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШаблонЗаполнения</name>
    <attributes>
      <name>ДеньВключенВГрафик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасписаниеРаботы</name>
    <attributes>
      <name>НомерДня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>торо_ПереходящееВремяНаСледующийДень</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/Календари/Forms/РасписаниеРаботы/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РасписаниеДня = Параметры.РасписаниеРаботы;
	
	// ТОИР++
	СоздатьРеквизитыИЭлементыТОИР();
	// ТОИР--
	
	Для Каждого ОписаниеИнтервала Из РасписаниеДня Цикл
		ЗаполнитьЗначенияСвойств(РасписаниеРаботы.Добавить(), ОписаниеИнтервала);
	КонецЦикла;
	// ТОИР++
	// Было
	// РасписаниеРаботы.Сортировать("ВремяНачала");
	РасписаниеРаботы.Сортировать("торо_ПереходящееВремяНаСледующийДень, ВремяНачала");
	// ТОИР--
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Авто;
		Элементы.ФормаОтмена.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РасписаниеРаботыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
		
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	// ТОИР++
	// Было
	// ГрафикиРаботыКлиент.ВосстановитьПорядокСтрокКоллекцииПослеРедактирования(РасписаниеРаботы, "ВремяНачала", Элемент.ТекущиеДанные);
	ВосстановитьПорядокСтрокКоллекцииПослеРедактирования(РасписаниеРаботы, "ВремяНачала", Элемент.ТекущиеДанные);
	// ТОИР--
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	ОповеститьОВыборе(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ТОИР++
&НаСервере
Процедура СоздатьРеквизитыИЭлементыТОИР()
	
	// Реквизиты
	МассивРеквизитов = Новый Массив;
	
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
	МетаРекв = Метаданные.Справочники.Календари.ТабличныеЧасти.РасписаниеРаботы.Реквизиты.торо_ПереходящееВремяНаСледующийДень;
	ИмяРекв = МетаРекв.Имя;
	ЗаголовокРекв = МетаРекв.Синоним;
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРекв, ОписаниеБулево, "РасписаниеРаботы", Заголовок));
	ИзменитьРеквизиты(МассивРеквизитов);
	
	// Элементы
	ЭлементРодитель = Элементы.РасписаниеРаботы;
	ИмяЭлемента = СтрШаблон("%1_%2", ЭлементРодитель.Имя, ИмяРекв);
	ЭлементПризнакПереходящегоВремени = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ЭлементРодитель);
	ЭлементПризнакПереходящегоВремени.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементПризнакПереходящегоВремени.ПутьКДанным = СтрШаблон("%1.%2", ЭлементРодитель.ПутьКДанным, ИмяРекв);
	ЭлементПризнакПереходящегоВремени.Заголовок = ЗаголовокРекв;
	
КонецПроцедуры
// ТОИР--

// ТОИР++
&НаКлиенте
Процедура ВосстановитьПорядокСтрокКоллекцииПослеРедактирования(КоллекцияСтрок, ПолеУпорядочивания, ТекущаяСтрока)
	
	Если КоллекцияСтрок.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущаяСтрока[ПолеУпорядочивания]) <> Тип("Дата") 
		И Не ЗначениеЗаполнено(ТекущаяСтрока[ПолеУпорядочивания]) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексИсходный = КоллекцияСтрок.Индекс(ТекущаяСтрока);
	ИндексРезультат = ИндексИсходный;
	
	// Выбираем направление, в котором нужно сдвинуть.
	Направление = 0;
	Если ИндексИсходный = 0 Тогда
		// вниз
		Направление = 1;
	КонецЕсли;
	Если ИндексИсходный = КоллекцияСтрок.Количество() - 1 Тогда
		// вверх
		Направление = -1;
	КонецЕсли;
	
	Если Направление = 0 Тогда
		Если КоллекцияСтрок[ИндексИсходный][ПолеУпорядочивания] > КоллекцияСтрок[ИндексРезультат + 1][ПолеУпорядочивания]
			И КоллекцияСтрок[ИндексИсходный].торо_ПереходящееВремяНаСледующийДень = КоллекцияСтрок[ИндексРезультат + 1].торо_ПереходящееВремяНаСледующийДень
			Или КоллекцияСтрок[ИндексИсходный].торо_ПереходящееВремяНаСледующийДень И НЕ КоллекцияСтрок[ИндексРезультат + 1].торо_ПереходящееВремяНаСледующийДень
			Тогда
			// вниз
			Направление = 1;
		КонецЕсли;
		Если КоллекцияСтрок[ИндексИсходный][ПолеУпорядочивания] < КоллекцияСтрок[ИндексРезультат - 1][ПолеУпорядочивания]
			И КоллекцияСтрок[ИндексИсходный].торо_ПереходящееВремяНаСледующийДень = КоллекцияСтрок[ИндексРезультат - 1].торо_ПереходящееВремяНаСледующийДень
			Или НЕ КоллекцияСтрок[ИндексИсходный].торо_ПереходящееВремяНаСледующийДень И КоллекцияСтрок[ИндексРезультат - 1].торо_ПереходящееВремяНаСледующийДень
			Тогда
			// вверх
			Направление = -1;
		КонецЕсли;
	КонецЕсли;
	
	Если Направление = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Направление = 1 Тогда
		// Сдвигать нужно пока значение в текущей строке больше, чем в следующей.
		Пока ИндексРезультат < КоллекцияСтрок.Количество() - 1 
			И (КоллекцияСтрок[ИндексИсходный][ПолеУпорядочивания] > КоллекцияСтрок[ИндексРезультат + 1][ПолеУпорядочивания]
			И КоллекцияСтрок[ИндексИсходный].торо_ПереходящееВремяНаСледующийДень = КоллекцияСтрок[ИндексРезультат + 1].торо_ПереходящееВремяНаСледующийДень
			Или КоллекцияСтрок[ИндексИсходный].торо_ПереходящееВремяНаСледующийДень И НЕ КоллекцияСтрок[ИндексРезультат + 1].торо_ПереходящееВремяНаСледующийДень)
			Цикл
			ИндексРезультат = ИндексРезультат + 1;
		КонецЦикла;
	Иначе
		// Сдвигать нужно пока значение в текущей строке меньше, чем в предыдущей.
		Пока ИндексРезультат > 0 
			И (КоллекцияСтрок[ИндексИсходный][ПолеУпорядочивания] < КоллекцияСтрок[ИндексРезультат - 1][ПолеУпорядочивания]
			И КоллекцияСтрок[ИндексИсходный].торо_ПереходящееВремяНаСледующийДень = КоллекцияСтрок[ИндексРезультат - 1].торо_ПереходящееВремяНаСледующийДень
			Или НЕ КоллекцияСтрок[ИндексИсходный].торо_ПереходящееВремяНаСледующийДень И КоллекцияСтрок[ИндексРезультат - 1].торо_ПереходящееВремяНаСледующийДень)
			Цикл
			ИндексРезультат = ИндексРезультат - 1;
		КонецЦикла;
	КонецЕсли;
	
	КоллекцияСтрок.Сдвинуть(ИндексИсходный, ИндексРезультат - ИндексИсходный);
	
КонецПроцедуры
// ТОИР--

&НаКлиенте
Функция РасписаниеДня()
	
	Отказ = Ложь;
	
	РасписаниеДня = Новый Массив;
	
	ОкончаниеДня = Неопределено;
	
	Для Каждого СтрокаРасписания Из РасписаниеРаботы Цикл
		ИндексСтроки = РасписаниеРаботы.Индекс(СтрокаРасписания);
		Если СтрокаРасписания.ВремяНачала > СтрокаРасписания.ВремяОкончания 
			И ЗначениеЗаполнено(СтрокаРасписания.ВремяОкончания) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("es='El tiempo ha comenzado más de tiempo de la terminación';ru='Время начала больше времени окончания';en='Start time longer than end time'"), ,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("РасписаниеРаботы[%1].ВремяОкончания", ИндексСтроки), ,
				Отказ);
		КонецЕсли;
		Если СтрокаРасписания.ВремяНачала = СтрокаРасписания.ВремяОкончания Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("es='La duración del intervalo no es determinada';ru='Длительность интервала не определена';en='Interval duration not defined'"), ,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("РасписаниеРаботы[%1].ВремяОкончания", ИндексСтроки), ,
				Отказ);
		КонецЕсли;
		Если ОкончаниеДня <> Неопределено Тогда
			// ТОИР++
			// Было:
			// Если ОкончаниеДня > СтрокаРасписания.ВремяНачала 
			Если ОкончаниеДня > СтрокаРасписания.ВремяНачала + ?(СтрокаРасписания.торо_ПереходящееВремяНаСледующийДень, 86400,0)
			// ТОИР--
				Или Не ЗначениеЗаполнено(ОкончаниеДня) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					НСтр("es='Son descubiertos los intervalos que se cruzan';ru='Обнаружены пересекающиеся интервалы';en='Intersecting intervals were found'"), ,
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("РасписаниеРаботы[%1].ВремяНачала", ИндексСтроки), ,
					Отказ);
			КонецЕсли;
		КонецЕсли;
		// ТОИР++
		// Было:
		// ОкончаниеДня = СтрокаРасписания.ВремяОкончания;
		// РасписаниеДня.Добавить(Новый Структура("ВремяНачала, ВремяОкончания", СтрокаРасписания.ВремяНачала, СтрокаРасписания.ВремяОкончания));
		Если СтрокаРасписания.торо_ПереходящееВремяНаСледующийДень Тогда
			ОкончаниеДня = СтрокаРасписания.ВремяОкончания + 86400;
		Иначе
			ОкончаниеДня = СтрокаРасписания.ВремяОкончания;
		КонецЕсли;
		РасписаниеДня.Добавить(Новый Структура("ВремяНачала, ВремяОкончания, торо_ПереходящееВремяНаСледующийДень", СтрокаРасписания.ВремяНачала, СтрокаРасписания.ВремяОкончания, СтрокаРасписания.торо_ПереходящееВремяНаСледующийДень));
		// ТОИР--
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РасписаниеДня;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	РасписаниеДня = РасписаниеДня();
	Если РасписаниеДня = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	ОповеститьОВыборе(Новый Структура("РасписаниеРаботы", РасписаниеДня));
	
КонецПроцедуры

#КонецОбласти
